/**
 * User: 1
 * Date: 04.02.2011
 * Time: 21:03:33
 */
package ru.datadir;

/**
 * Право пользователя.
 * Право может относиться к редактированию данных в справочнике,
 * или к редактированию раздела (то есть всех справочников внутри раздела).
 */
public enum Right
{
	/**
	 * Право на просмотр записей в справочнике.
	 */
	read_record,

	/**
	 * Право на редактирование (создание, изменение и удаление) записей в справочнике.
	 */
	edit_record,

	/**
	 * Право просматривать справочник (структуру) или раздел.
	 */
	read,

	/**
	 * Право редактировать структуру справочника (набор атрибутов) или раздела (набор дочерних справочников и разделов).
	 */
	edit
}